adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.h
/**
  * @brief UARTE_TXD [TXD] (TXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IOM uint32_t  MAXCNT;                       /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
} UARTE_TXD_Type;                               /*!< Size = 12 (0xc)                                                           */


/**
  * @brief M2M_IN [IN] (Memory to memory input channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IOM uint32_t  MAXCNT;                       /*!< (@ 0x00000004) Maximum number of bytes in input and output buffer         */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
  __IOM uint32_t  LIST;                         /*!< (@ 0x0000000C) EasyDMA list type                                          */
} M2M_IN_Type;                                  /*!< Size = 16 (0x10)                                                          */


/**
  * @brief M2M_OUT [OUT] (Memory to memory output channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000004) Number of bytes transferred in the last transaction        */
  __IOM uint32_t  LIST;                         /*!< (@ 0x00000008) EasyDMA list type                                          */
} M2M_OUT_Type;                                 /*!< Size = 12 (0xc)                                                           */


/**
  * @brief GPIO_PIN [PIN] (Pin n direct access)
  */
typedef struct {
  __IOM uint32_t  OUT;                          /*!< (@ 0x00000000) Description cluster: Pin n direct access output
                                                                    register                                                   */
  __IOM uint32_t  IN;                           /*!< (@ 0x00000004) Description cluster: Pin n direct access input
                                                                    register                                                   */
} GPIO_PIN_Type;                                /*!< Size = 8 (0x8)                                                            */


/**
  * @brief VMC_RAM [RAM] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) Description cluster: RAMn power control register           */
  __OM  uint32_t  POWERSET;                     /*!< (@ 0x00000004) Description cluster: RAMn power control set register       */
  __OM  uint32_t  POWERCLR;                     /*!< (@ 0x00000008) Description cluster: RAMn power control clear
                                                                    register                                                   */
  __IM  uint32_t  RESERVED;
} VMC_RAM_Type;                                 /*!< Size = 16 (0x10)                                                          */


/**
  * @brief VMC_RAMA [RAMA] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) RAM B{n} power control register                            */
  __OM  uint32_t  POWERSET;                     /*!< (@ 0x00000004) RAM B{n} power control set register                        */
  __OM  uint32_t  POWERCLR;                     /*!< (@ 0x00000008) RAM B{n} power control clear register                      */
} VMC_RAMA_Type;                                /*!< Size = 12 (0xc)                                                           */


/**
  * @brief VMC_RAMB [RAMB] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) Description cluster: RAM Bn power control register         */
  __OM  uint32_t  POWERSET;                     /*!< (@ 0x00000004) Description cluster: RAM Bn power control set
                                                                    register                                                   */
  __OM  uint32_t  POWERCLR;                     /*!< (@ 0x00000008) Description cluster: RAM Bn power control clear
                                                                    register                                                   */
  __IM  uint32_t  RESERVED;
} VMC_RAMB_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief VMC_RAMC [RAMC] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) Description cluster: RAM Cn power control register         */
  __OM  uint32_t  POWERSET;                     /*!< (@ 0x00000004) Description cluster: RAM Cn power control set
                                                                    register                                                   */
  __OM  uint32_t  POWERCLR;                     /*!< (@ 0x00000008) Description cluster: RAM Cn power control clear
                                                                    register                                                   */
  __IM  uint32_t  RESERVED;
} VMC_RAMC_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief VMC_RAMD [RAMD] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) RAM D{n} power control register                            */
  __OM  uint32_t  POWERSET;                     /*!< (@ 0x00000004) RAM D{n} power control set register                        */
  __OM  uint32_t  POWERCLR;                     /*!< (@ 0x00000008) RAM D{n} power control clear register                      */
} VMC_RAMD_Type;                                /*!< Size = 12 (0xc)                                                           */


/** @} */ /* End of group Device_Peripheral_clusters */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           FICR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Factory Information Configuration Registers (FICR)
  */

typedef struct {                                /*!< (@ 0x00FF0000) FICR Structure                                             */
  __IM  uint32_t  RESERVED[64];
  __IM  uint32_t  TESTSTATUS;                   /*!< (@ 0x00000100) Code memory test status. Will be set during production
                                                                    test.                                                      */
  __IM  uint32_t  CPTEST0;                      /*!< (@ 0x00000104) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST00;                     /*!< (@ 0x00000108) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST1;                      /*!< (@ 0x0000010C) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST2;                      /*!< (@ 0x00000110) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST3;                      /*!< (@ 0x00000114) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST4;                      /*!< (@ 0x00000118) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST5;                      /*!< (@ 0x0000011C) Result from Circuit Probe test, flash repair
                                                                    information                                                */
  __IM  uint32_t  CPTEST6;                      /*!< (@ 0x00000120) Result from Circuit Probe test, flash repair
                                                                    information                                                */
  __IM  uint32_t  CPTEST7;                      /*!< (@ 0x00000124) Result from Circuit Probe test, flash repair
                                                                    information                                                */
  __IM  uint32_t  CPTEST8;                      /*!< (@ 0x00000128) Result from Circuit Probe test, flash repair
                                                                    information                                                */
  __IM  uint32_t  RESERVED1[53];
  __IOM FICR_INFO_Type INFO;                    /*!< (@ 0x00000200) Device info                                                */
  __IM  uint32_t  RESERVED2[7];
  __IM  uint32_t  CHIPCONF02;                   /*!< (@ 0x00000248) Miscellaneous analog configuration. Will be set
                                                                    during production test.                                    */
  __IM  uint32_t  RESERVED3[13];
  __IM  uint32_t  FLASHPWRUP0;                  /*!< (@ 0x00000280) Power-up pattern for flash                                 */
  __IM  uint32_t  FLASHPWRUP1;                  /*!< (@ 0x00000284) Power-up pattern for flash                                 */
  __IM  uint32_t  RESERVED4[30];
  __IOM FICR_TRIMCNF_Type TRIMCNF[5];           /*!< (@ 0x00000300) Unspecified                                                */
  __IM  uint32_t  RESERVED5[310];
  __IM  uint32_t  PRODTEST[3];                  /*!< (@ 0x00000800) Description collection: Production test control
                                                                    n                                                          */
  __IM  uint32_t  BPROTINIT;                    /*!< (@ 0x0000080C) BPROT initialization data                                  */
  __IM  uint32_t  PUBLICID[4];                  /*!< (@ 0x00000810) Description collection: Public ID n                        */
  __IM  uint32_t  ROOTKEY0[68];                 /*!< (@ 0x00000820) Description collection: Root public key 0, total
                                                                    length 2176 bits = 272 bytes (end address
                                                                    is 0x92F)                                                  */
  __IM  uint32_t  ROOTKEY1[68];                 /*!< (@ 0x00000930) Description collection: Root public key 1, total
                                                                    length 2176 bits = 272 bytes (end address
                                                                    is 0xA3F)                                                  */
  __IM  uint32_t  ROOTKEY2[68];                 /*!< (@ 0x00000A40) Description collection: Root public key 2, total
                                                                    length 2176 bits = 272 bytes (end address
                                                                    is 0xB4F)                                                  */
  __IM  uint32_t  ROOTKEY3[68];                 /*!< (@ 0x00000B50) Description collection: Root public key 3, total
                                                                    length 2176 bits = 272 bytes (end address
                                                                    is 0xC5F)                                                  */
  __IM  uint32_t  IMEI[2];                      /*!< (@ 0x00000C60) Description collection: IMEI n                             */
  __IM  uint32_t  MAC0[2];                      /*!< (@ 0x00000C68) Description collection: MAC0 n                             */
  __IM  uint32_t  MAC1[2];                      /*!< (@ 0x00000C70) Description collection: MAC1 n                             */
  __IM  uint32_t  MAC2[2];                      /*!< (@ 0x00000C78) Description collection: MAC2 n                             */
  __IM  uint32_t  MAC3[2];                      /*!< (@ 0x00000C80) Description collection: MAC3 n                             */
  __IM  uint32_t  RESERVED6[2];
  __IM  uint32_t  DEVCONF[4];                   /*!< (@ 0x00000C90) Description collection: Device configuration
                                                                    n                                                          */
  __IM  uint32_t  RESERVED7[56];
  __IM  uint32_t  DOWNGRADEPREV;                /*!< (@ 0x00000D80) Downgrade prevention control. Totally 128 bits
                                                                    within 256 bytes, located in groups of 8
                                                                    bits per 128 bit word (distributed due to
                                                                    Flash write count limit)                                   */
  __IM  uint32_t  RESERVED8[63];
  __IM  uint32_t  KEYREVOCATION;                /*!< (@ 0x00000E80) Key revocation control                                     */
  __IM  uint32_t  RESERVED9[3];
  __IM  uint32_t  LIFECYCLESTATE;               /*!< (@ 0x00000E90) Lifecycle state [7:0]                                      */
  __IM  uint32_t  RESERVED10[3];
  __IM  uint32_t  DEBUGCNTRL0;                  /*!< (@ 0x00000EA0) Debug control bits [7:0]                                   */
  __IM  uint32_t  RESERVED11[3];
  __IM  uint32_t  DEBUGCNTRL1;                  /*!< (@ 0x00000EB0) Debug control bits [13:8]                                  */
  __IM  uint32_t  RESERVED12[3];
  __IM  uint32_t  UNLOCKCODESTATE;              /*!< (@ 0x00000EC0) SIM unlock code state for each lock level                  */
  __IM  uint32_t  RESERVED13[3];
  __IM  uint32_t  SIMLOCKDISABLE;               /*!< (@ 0x00000ED0) SIM lock controls for each lock level.  Disabling
                                                                    removes lock permanently                                   */
  __IM  uint32_t  RESERVED14[59];
  __IM  uint32_t  SECMASTERKEY[4];              /*!< (@ 0x00000FC0) Description collection: Secure master key n                */
} NRF_FICR_Type;                                /*!< Size = 4048 (0xfd0)                                                       */



/* =========================================================================================================================== */
/* ================                                           UICR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief User Information Configuration Registers (UICR)
  */

typedef struct {                                /*!< (@ 0x00FF8000) UICR Structure                                             */
  __IM  uint32_t  NCKLOCK[4];                   /*!< (@ 0x00000000) Description collection: Encrypted unlock code
                                                                    data for network lock n                                    */
  __IM  uint32_t  NSCKLOCK[4];                  /*!< (@ 0x00000010) Description collection: Encrypted unlock code
                                                                    data for network subset lock n                             */
  __IM  uint32_t  SPCKLOCK[4];                  /*!< (@ 0x00000020) Description collection: Encrypted unlock code
                                                                    data for service provider lock n                           */
  __IM  uint32_t  CCKLOCK[4];                   /*!< (@ 0x00000030) Description collection: Encrypted unlock code
                                                                    data for corporate lock n                                  */
  __IM  uint32_t  PCKLOCK[4];                   /*!< (@ 0x00000040) Description collection: Encrypted unlock code
                                                                    data for SIM/USIM lock n                                   */
  __IM  uint32_t  MASTERLOCK[4];                /*!< (@ 0x00000050) Description collection: Space reservation for
                                                                    encrypted master unlock code data n                        */
  __IM  uint32_t  PROVIS[4];                    /*!< (@ 0x00000060) Description collection: Provisioning data n                */
  __IM  uint32_t  CUSTIMEI[2];                  /*!< (@ 0x00000070) Description collection: Customer IMEI n, used
                                                                    if FICR-&gt;IMEI  is not programmed                        */
  __IM  uint32_t  RESERVED[2];
  __IM  uint32_t  CUSTMAC0[2];                  /*!< (@ 0x00000080) Description collection: Customer MAC0 n, used
                                                                    if FICR-&gt;MAC0  is not programmed                        */
  __IM  uint32_t  CUSTMAC1[2];                  /*!< (@ 0x00000088) Description collection: Customer MAC1 n, used
                                                                    if FICR-&gt;MAC1  is not programmed                        */
  __IM  uint32_t  CUSTMAC2[2];                  /*!< (@ 0x00000090) Description collection: Customer MAC2 n, used
                                                                    if FICR-&gt;MAC2  is not programmed                        */
  __IM  uint32_t  CUSTMAC3[2];                  /*!< (@ 0x00000098) Description collection: Customer MAC3 n, used
                                                                    if FICR-&gt;MAC3  is not programmed                        */
  __IM  uint32_t  CUSTDEVCONF[4];               /*!< (@ 0x000000A0) Description collection: Customer device configuration
                                                                    n, may be used to further  limit configuration
                                                                    done by FICR-&gt;DEVCONF                                   */
  __IM  uint32_t  RESERVED1[468];
  __IM  uint32_t  SIMLOCK;                      /*!< (@ 0x00000800) SIM lock data. Content and length T.B.D.                   */
  __IM  uint32_t  RESERVED2[383];
  __IM  uint32_t  RFTUNING;                     /*!< (@ 0x00000E00) RF tuning data. Content and length T.B.D.                  */
} NRF_UICR_Type;                                /*!< Size = 3588 (0xe04)                                                       */



/* =========================================================================================================================== */
/* ================                                       TRACEANDDEBUG                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief Trace And Debug (TRACEANDDEBUG)
  */

