adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.h
typedef struct {                                /*!< (@ 0xE0080000) TRACEANDDEBUG Structure                                    */
  __OM  uint32_t  STARTCLOCKS;                  /*!< (@ 0x00000000) Start all Trace and Debug clocks.                          */
  __OM  uint32_t  STOPCLOCKS;                   /*!< (@ 0x00000004) Stop all Trace and Debug clocks.                           */
  __IM  uint32_t  RESERVED[22];
  __OM  uint32_t  TASKZEROPENALTY_PCP_3;        /*!< (@ 0x00000060) TaskZeroPenalty register for PCP 3                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_3;        /*!< (@ 0x00000064) TaskFullPenalty register for PCP 3                         */
  __OM  uint32_t  TASKZEROPENALTY_PCP_2;        /*!< (@ 0x00000068) TaskZeroPenalty register for PCP 2                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_2;        /*!< (@ 0x0000006C) TaskFullPenalty register for PCP 2                         */
  __OM  uint32_t  TASKZEROPENALTY_PCP_1;        /*!< (@ 0x00000070) TaskZeroPenalty register for PCP 1                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_1;        /*!< (@ 0x00000074) TaskFullPenalty register for PCP 1                         */
  __OM  uint32_t  TASKZEROPENALTY_PCP_0;        /*!< (@ 0x00000078) TaskZeroPenalty register for PCP 0                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_0;        /*!< (@ 0x0000007C) TaskFullPenalty register for PCP 0                         */
  __IM  uint32_t  RESERVED1[288];
  __IOM uint32_t  ENABLEDEBUG;                  /*!< (@ 0x00000500) Master enable for PSEL.TraceData[3:0] and PSEL.TraceClk
                                                                    signals                                                    */
  __IOM TRACEANDDEBUGALTA_PSEL_Type PSEL;       /*!< (@ 0x00000504) Unspecified                                                */
  __IOM uint32_t  TRACEPORTSPEED;               /*!< (@ 0x00000518) Trace port speed selection                                 */
  __IOM uint32_t  SWOSEL;                       /*!< (@ 0x0000051C) Connect the SWO to the TPIU TRACEDATA[0]                   */
  __IOM uint32_t  SRAMTSEL;                     /*!< (@ 0x00000520) Timing control values for TSMC RAMs                        */
  __IM  uint32_t  RESERVED2[439];
  __IOM uint32_t  PENALTY_REG[4];               /*!< (@ 0x00000C00) Description collection: Penalty register for
                                                                    PCP n                                                      */
  __IOM uint32_t  FORCE_OVERRIDE[4];            /*!< (@ 0x00000C10) Description collection: Force override register
                                                                    for PCP n                                                  */
  __IM  uint32_t  RESERVED3[4];
  __IOM uint32_t  TURN_OFF_AUTO_CLOCKSOURCE_REQ;/*!< (@ 0x00000C30) Turn of the automatic clock request.                       */
} NRF_TRACEANDDEBUGALTA_Type;                   /*!< Size = 3124 (0xc34)                                                       */



/* =========================================================================================================================== */
/* ================                                           AMLI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief AHB Multi-Layer Interface (AMLI)
  */

typedef struct {                                /*!< (@ 0x40000000) AMLI Structure                                             */
  __IM  uint32_t  RESERVED[896];
  __IOM AMLI_RAMPRI_Type RAMPRI;                /*!< (@ 0x00000E00) RAM configurable priority configuration structure          */
} NRF_AMLI_Type;                                /*!< Size = 3596 (0xe0c)                                                       */



/* =========================================================================================================================== */
/* ================                                           DCNF                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Domain Configuration Management (DCNF)
  */

typedef struct {                                /*!< (@ 0x40000000) DCNF Structure                                             */
  __IM  uint32_t  RESERVED[264];
  __IM  uint32_t  CPUID;                        /*!< (@ 0x00000420) CPU number in the system                                   */
  __IM  uint32_t  RESERVED1[7];
  __IOM DCNF_EXTPERI0_Type EXTPERI0;            /*!< (@ 0x00000440) Unspecified                                                */
  __IM  uint32_t  RESERVED2[6];
  __IOM DCNF_EXTRAM_Type EXTRAM;                /*!< (@ 0x00000460) Unspecified                                                */
  __IM  uint32_t  RESERVED3[6];
  __IOM DCNF_EXTCODE_Type EXTCODE[2];           /*!< (@ 0x00000480) Unspecified                                                */
} NRF_DCNF_Type;                                /*!< Size = 1160 (0x488)                                                       */



/* =========================================================================================================================== */
/* ================                                            MWU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Memory Watch Unit (MWU)
  */

typedef struct {                                /*!< (@ 0x40001000) MWU Structure                                              */
  __IM  uint32_t  RESERVED[64];
  __IOM MWU_EVENTS_REGION_Type EVENTS_REGION[4];/*!< (@ 0x00000100) Peripheral events.                                         */
  __IM  uint32_t  RESERVED1[16];
  __IOM MWU_EVENTS_PREGION_Type EVENTS_PREGION[2];/*!< (@ 0x00000160) Peripheral events.                                       */
  __IM  uint32_t  RESERVED2[100];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED3[5];
  __IOM uint32_t  NMIEN;                        /*!< (@ 0x00000320) Enable or disable interrupt                                */
  __IOM uint32_t  NMIENSET;                     /*!< (@ 0x00000324) Enable interrupt                                           */
  __IOM uint32_t  NMIENCLR;                     /*!< (@ 0x00000328) Disable interrupt                                          */
  __IM  uint32_t  RESERVED4[53];
  __IOM MWU_PERREGION_Type PERREGION[2];        /*!< (@ 0x00000400) Unspecified                                                */
  __IM  uint32_t  RESERVED5[64];
  __IOM uint32_t  REGIONEN;                     /*!< (@ 0x00000510) Enable/disable regions watch                               */
  __IOM uint32_t  REGIONENSET;                  /*!< (@ 0x00000514) Enable regions watch                                       */
  __IOM uint32_t  REGIONENCLR;                  /*!< (@ 0x00000518) Disable regions watch                                      */
  __IM  uint32_t  RESERVED6[57];
  __IOM MWU_REGION_Type REGION[4];              /*!< (@ 0x00000600) Unspecified                                                */
  __IM  uint32_t  RESERVED7[32];
  __IOM MWU_PREGION_Type PREGION[2];            /*!< (@ 0x000006C0) Unspecified                                                */
} NRF_MWU_Type;                                 /*!< Size = 1760 (0x6e0)                                                       */



/* =========================================================================================================================== */
/* ================                                           MCPLL                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Modem Clock PLL (MCPLL)
  */

typedef struct {                                /*!< (@ 0x40010000) MCPLL Structure                                            */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start MCPLL                                                */
  __OM  uint32_t  TASKS_UPDATE;                 /*!< (@ 0x00000004) Update CONTROL.FRAC and CONTROL.INT values                 */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000008) Stop MCPLL                                                 */
  __IM  uint32_t  RESERVED[61];
  __IOM uint32_t  EVENTS_STARTED;               /*!< (@ 0x00000100) MCPLL started                                              */
  __IOM uint32_t  EVENTS_LOCKERROR;             /*!< (@ 0x00000104) Error event, MCPLL no longer in lock                       */
  __IM  uint32_t  RESERVED1[126];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[60];
  __IM  uint32_t  INLOCK;                       /*!< (@ 0x00000400) MCPLL locked or not                                        */
  __IM  uint32_t  RESERVED3[64];
  __IOM MCPLL_CONTROL_Type CONTROL;             /*!< (@ 0x00000504) Unspecified                                                */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  MA;                           /*!< (@ 0x00000510) Post division ratio for OUTA                               */
  __IOM uint32_t  MB;                           /*!< (@ 0x00000514) Post division ratio for OUTB                               */
  __IOM uint32_t  MC;                           /*!< (@ 0x00000518) Post division ratio for OUTC                               */
  __IOM uint32_t  INTMODE;                      /*!< (@ 0x0000051C) Integer mode                                               */
  __IOM uint32_t  FORCEINLOCK;                  /*!< (@ 0x00000520) Force MCPLL in lock                                        */
  __IOM uint32_t  RESET;                        /*!< (@ 0x00000524) Reset MCPLL                                                */
  __IOM uint32_t  SPARE;                        /*!< (@ 0x00000528) Spare signals                                              */
  __IM  uint32_t  RESERVED5;
  __IOM MCPLL_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000530) Override mechanism                                         */
  __IM  uint32_t  RESERVED6[49];
  __IOM uint32_t  TEST;                         /*!< (@ 0x00000600) ATE test bus control                                       */
} NRF_MCPLL_Type;                               /*!< Size = 1540 (0x604)                                                       */



/* =========================================================================================================================== */
/* ================                                           BBDLL                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Base Band  DLL (BBDLL)
  */

