adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.h
typedef struct {                                /*!< (@ 0x40011000) BBDLL Structure                                            */
  __IM  uint32_t  RESERVED[64];
  __IOM uint32_t  EVENTS_LOCKERROR;             /*!< (@ 0x00000100) Error event, BBDLL no longer in lock                       */
  __IM  uint32_t  RESERVED1[127];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[60];
  __IM  uint32_t  INLOCK;                       /*!< (@ 0x00000400) BBDLL locked or not                                        */
  __IM  uint32_t  RESERVED3[71];
  __IOM BBDLL_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000520) Override mechanism                                         */
  __IM  uint32_t  RESERVED4[55];
  __IOM uint32_t  TEST;                         /*!< (@ 0x00000600) Unspecified                                                */
} NRF_BBDLL_Type;                               /*!< Size = 1540 (0x604)                                                       */



/* =========================================================================================================================== */
/* ================                                         RCOSC32K                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief 32.768 kHz RC oscillator (RCOSC32K)
  */

typedef struct {                                /*!< (@ 0x40012000) RCOSC32K Structure                                         */
  __OM  uint32_t  TASKS_CAL;                    /*!< (@ 0x00000000) Start calibration of LFRC or LFULP oscillator              */
  __OM  uint32_t  TASKS_CTSTART;                /*!< (@ 0x00000004) Start calibration timer                                    */
  __OM  uint32_t  TASKS_CTSTOP;                 /*!< (@ 0x00000008) Stop calibration timer                                     */
  __IM  uint32_t  RESERVED[64];
  __IOM uint32_t  EVENTS_DONE;                  /*!< (@ 0x0000010C) Calibration of LFCLK RC oscillator complete event          */
  __IM  uint32_t  RESERVED1[124];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[68];
  __IM  uint32_t  RCOSC32KIFINE;                /*!< (@ 0x00000420) Fine calibration read value for 32.768 kHz RC
                                                                    oscillator (retained register, same reset
                                                                    behaviour as RESETREAS)                                    */
  __IM  uint32_t  RCOSC32KICOARSE;              /*!< (@ 0x00000424) Coarse calibration read value for 32.768 kHz
                                                                    RC oscillator (Retained register, same reset
                                                                    behaviour as RESETREAS)                                    */
  __IM  uint32_t  RESERVED3[67];
  __IOM uint32_t  RCOSC32KICALTEST;             /*!< (@ 0x00000534) 32.768 kHz RC oscillator calibration debug register
                                                                    (retained register, same reset behaviour
                                                                    as RESETREAS)                                              */
  __IOM uint32_t  CTIV;                         /*!< (@ 0x00000538) Calibration timer interval (retained register,
                                                                    same reset behaviour as RESETREAS)                         */
  __IOM uint32_t  RCOSC32KICALLENGTH;           /*!< (@ 0x0000053C) 32kHz RC oscillator calibration length (retained
                                                                    register, same reset behaviour as RESETREAS)               */
  __IOM uint32_t  RCOSC32KICOARSEIN;            /*!< (@ 0x00000540) RCOSC coarse calibration input (retained register,
                                                                    same reset behaviour as RESETREAS)                         */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint32_t  RCOSC32KICIRC;                /*!< (@ 0x0000054C) Rotating current source for for 32.768 kHz RC
                                                                    oscillator (retained register, same reset
                                                                    behaviour as RESETREAS)                                    */
  __IM  uint32_t  RESERVED5[13];
  __IOM uint32_t  ATECLOCK;                     /*!< (@ 0x00000584) Analog test bus control for clock modules                  */
  __IM  uint32_t  RESERVED6[10];
  __IOM uint32_t  LFULP32KICIRC;                /*!< (@ 0x000005B0) Rotating current source for 32.768 kHz ULP RC
                                                                    oscillator                                                 */
  __IOM uint32_t  LFULP32KICALLENGTH;           /*!< (@ 0x000005B4) 32kHz LFULP RC oscillator calibration length               */
  __IOM uint32_t  LFULP32KICOARSE;              /*!< (@ 0x000005B8) Coarse calibration read value for 32.768 kHz
                                                                    ULP RC oscillator                                          */
} NRF_RCOSC32K_Type;                            /*!< Size = 1468 (0x5bc)                                                       */



/* =========================================================================================================================== */
/* ================                                          DCLOCK                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock Management (DCLOCK)
  */

typedef struct {                                /*!< (@ 0x40015000) DCLOCK Structure                                           */
  __OM  uint32_t  TASKS_HFCLKSTART;             /*!< (@ 0x00000000) Start HFCLK crystal oscillator                             */
  __OM  uint32_t  TASKS_HFCLKSTOP;              /*!< (@ 0x00000004) Stop HFCLK crystal oscillator                              */
  __OM  uint32_t  TASKS_LFCLKSTART;             /*!< (@ 0x00000008) Start LFCLK source                                         */
  __OM  uint32_t  TASKS_LFCLKSTOP;              /*!< (@ 0x0000000C) Stop LFCLK source                                          */
  __IM  uint32_t  RESERVED[60];
  __IOM uint32_t  EVENTS_HFCLKSTARTED;          /*!< (@ 0x00000100) HFCLK oscillator started                                   */
  __IOM uint32_t  EVENTS_LFCLKSTARTED;          /*!< (@ 0x00000104) LFCLK started                                              */
  __IM  uint32_t  RESERVED1[126];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[62];
  __IM  uint32_t  HFCLKRUN;                     /*!< (@ 0x00000408) Status indicating that HFCLKSTART task has been
                                                                    triggered                                                  */
  __IM  uint32_t  HFCLKSTAT;                    /*!< (@ 0x0000040C) Which HFCLK source is running                              */
  __IM  uint32_t  RESERVED3;
  __IM  uint32_t  LFCLKRUN;                     /*!< (@ 0x00000414) Status indicating that LFCLKSTART task has been
                                                                    triggered                                                  */
  __IM  uint32_t  LFCLKSTAT;                    /*!< (@ 0x00000418) Which LFCLK source is running                              */
  __IM  uint32_t  LFCLKSRCCOPY;                 /*!< (@ 0x0000041C) Copy of LFCLKSRC register, set when LFCLKSTART
                                                                    task was triggered LFULP is not treat as
                                                                    a separate clock source on Alta MLM1, where
                                                                    default clock source (0) is LFRC.                          */
  __IM  uint32_t  RESERVED4[4];
  __IOM uint32_t  HFCLKCURRFREQ;                /*!< (@ 0x00000430) Current frequency of HFCLK                                 */
  __IM  uint32_t  RESERVED5[56];
  __IOM uint32_t  HFCLKSRC;                     /*!< (@ 0x00000514) Clock source for the HFCLK oscillator, and configuration
                                                                    of XTAL oscillator. This register shall
                                                                    only be written while no oscillation is
                                                                    present on XC1. Failing to do so may cause
                                                                    unexpected behaviour.                                      */
  __IOM uint32_t  LFCLKSRC;                     /*!< (@ 0x00000518) Clock source for the LFCLK. LFCLKSTART task starts
                                                                    starts a clock source selected with this
                                                                    register. LFULP is not treat as a separate
                                                                    clock source on Alta MLM1, where default
                                                                    clock source (0) is LFRC.                                  */
  __IM  uint32_t  RESERVED6[15];
  __IOM uint32_t  HFCLKCTRL;                    /*!< (@ 0x00000558) HFCLK frequency configuration.                             */
} NRF_DCLOCK_Type;                              /*!< Size = 1372 (0x55c)                                                       */



/* =========================================================================================================================== */
/* ================                                          DPOWER                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Power Control (DPOWER)
  */

