adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.h
typedef struct {                                /*!< (@ 0x40015000) DPOWER Structure                                           */
  __IM  uint32_t  RESERVED[30];
  __OM  uint32_t  TASKS_CONSTLAT;               /*!< (@ 0x00000078) Enable constant latency mode. When going to sleep:
                                                                    CPU is clock gated, but regulators, oscillators
                                                                    and clock tree is kept on.                                 */
  __OM  uint32_t  TASKS_LOWPWR;                 /*!< (@ 0x0000007C) Enable low power mode (variable latency) When
                                                                    going to sleep: Oscillators are switched
                                                                    off (if nothing else is requesting clocks).
                                                                    Regulators are switched off (if nothing
                                                                    else is requesting power).                                 */
  __IM  uint32_t  RESERVED1[34];
  __IOM uint32_t  EVENTS_POFWARN;               /*!< (@ 0x00000108) Power failure warning                                      */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  EVENTS_SLEEPENTER;            /*!< (@ 0x00000114) CPU entered WFI/WFE sleep                                  */
  __IOM uint32_t  EVENTS_SLEEPEXIT;             /*!< (@ 0x00000118) CPU exited WFI/WFE sleep                                   */
  __IM  uint32_t  RESERVED3[121];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED4[61];
  __IOM uint32_t  RESETREAS;                    /*!< (@ 0x00000400) Reset reason                                               */
  __IM  uint32_t  RESERVED5[67];
  __IOM uint32_t  SLEEPCNF;                     /*!< (@ 0x00000510) Sleep configuration                                        */
  __IM  uint32_t  RESERVED6[2];
  __IOM uint32_t  GPREGRET[2];                  /*!< (@ 0x0000051C) Description collection: General purpose retention
                                                                    register                                                   */
  __IM  uint32_t  RESERVED7[59];
  __IOM DPOWER_DSP_Type DSP;                    /*!< (@ 0x00000610) Control register for DSP                                   */
  __IOM DPOWER_LYNX_Type LYNX;                  /*!< (@ 0x00000620) Control register for Lynx RF subsystem                     */
} NRF_DPOWER_Type;                              /*!< Size = 1580 (0x62c)                                                       */



/* =========================================================================================================================== */
/* ================                                        MODEMPERIPH                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Modem peripheral registers (MODEMPERIPH)
  */

typedef struct {                                /*!< (@ 0x40021000) MODEMPERIPH Structure                                      */
  __IM  uint32_t  RESERVED[28];
  __OM  uint32_t  TASKZEROPENALTY_PCP_1;        /*!< (@ 0x00000070) TaskZeroPenalty register for PCP 1                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_1;        /*!< (@ 0x00000074) TaskFullPenalty register for PCP 1                         */
  __OM  uint32_t  TASKZEROPENALTY_PCP_0;        /*!< (@ 0x00000078) TaskZeroPenalty register for PCP 0                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_0;        /*!< (@ 0x0000007C) TaskFullPenalty register for PCP 0                         */
  __IM  uint32_t  RESERVED1[736];
  __IOM uint32_t  PENALTY_REG[2];               /*!< (@ 0x00000C00) Description collection: Penalty register for
                                                                    PCP n                                                      */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  FORCE_OVERRIDE[2];            /*!< (@ 0x00000C10) Description collection: Force override register
                                                                    for PCP n                                                  */
  __IM  uint32_t  RESERVED3[6];
  __IOM uint32_t  TURN_OFF_AUTO_CLOCKSOURCE_REQ;/*!< (@ 0x00000C30) Turn of the automatic clock request.                       */
} NRF_MODEMPERIPH_Type;                         /*!< Size = 3124 (0xc34)                                                       */



/* =========================================================================================================================== */
/* ================                                           UARTE                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART with EasyDMA (UARTE)
  */

typedef struct {                                /*!< (@ 0x40023000) UARTE Structure                                            */
  __OM  uint32_t  TASKS_STARTRX;                /*!< (@ 0x00000000) Start UART receiver                                        */
  __OM  uint32_t  TASKS_STOPRX;                 /*!< (@ 0x00000004) Stop UART receiver                                         */
  __OM  uint32_t  TASKS_STARTTX;                /*!< (@ 0x00000008) Start UART transmitter                                     */
  __OM  uint32_t  TASKS_STOPTX;                 /*!< (@ 0x0000000C) Stop UART transmitter                                      */
  __IM  uint32_t  RESERVED[3];
  __OM  uint32_t  TASKS_SUSPEND;                /*!< (@ 0x0000001C) Suspend UART transaction                                   */
  __OM  uint32_t  TASKS_RESUME;                 /*!< (@ 0x00000020) Resume UART transaction                                    */
  __IM  uint32_t  RESERVED1[2];
  __OM  uint32_t  TASKS_FLUSHRX;                /*!< (@ 0x0000002C) Flush RX FIFO into RX buffer                               */
  __IM  uint32_t  RESERVED2[52];
  __IOM uint32_t  EVENTS_CTS;                   /*!< (@ 0x00000100) CTS is activated (set low). Clear To Send.                 */
  __IOM uint32_t  EVENTS_NCTS;                  /*!< (@ 0x00000104) CTS is deactivated (set high). Not Clear To Send.          */
  __IOM uint32_t  EVENTS_RXDRDY;                /*!< (@ 0x00000108) Data received in RXD (but potentially not yet
                                                                    transferred to Data RAM)                                   */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  EVENTS_ENDRX;                 /*!< (@ 0x00000110) Receive buffer is filled up                                */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint32_t  EVENTS_TXDRDY;                /*!< (@ 0x0000011C) Data sent from TXD                                         */
  __IOM uint32_t  EVENTS_ENDTX;                 /*!< (@ 0x00000120) Last TX byte transmitted                                   */
  __IOM uint32_t  EVENTS_ERROR;                 /*!< (@ 0x00000124) Error detected                                             */
  __IM  uint32_t  RESERVED5[7];
  __IOM uint32_t  EVENTS_RXTO;                  /*!< (@ 0x00000144) Receiver timeout                                           */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  EVENTS_RXSTARTED;             /*!< (@ 0x0000014C) UART receiver has started                                  */
  __IOM uint32_t  EVENTS_TXSTARTED;             /*!< (@ 0x00000150) UART transmitter has started                               */
  __IOM uint32_t  EVENTS_RTS;                   /*!< (@ 0x00000154) RX FIFO has only room for four more bytes before
                                                                    it overflows                                               */
  __IOM uint32_t  EVENTS_TXSTOPPED;             /*!< (@ 0x00000158) Transmitter stopped                                        */
  __IM  uint32_t  RESERVED7[41];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED8[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED9[93];
  __IOM uint32_t  ERRORSRC;                     /*!< (@ 0x00000480) Error source                                               */
  __IM  uint32_t  RESERVED10[31];
  __IOM uint32_t  ENABLE;                       /*!< (@ 0x00000500) Enable UART                                                */
  __IM  uint32_t  RESERVED11;
  __IOM UARTE_PSEL_Type PSEL;                   /*!< (@ 0x00000508) Unspecified                                                */
  __IM  uint32_t  RESERVED12[3];
  __IOM uint32_t  BAUDRATE;                     /*!< (@ 0x00000524) Baud rate                                                  */
  __IM  uint32_t  RESERVED13[3];
  __IOM UARTE_RXD_Type RXD;                     /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
  __IM  uint32_t  RESERVED14;
  __IOM UARTE_TXD_Type TXD;                     /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
  __IM  uint32_t  RESERVED15[7];
  __IOM uint32_t  CONFIG;                       /*!< (@ 0x0000056C) Configuration of parity and hardware flow control          */
  __IM  uint32_t  RESERVED16[675];
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000FFC) Peripheral power control                                   */
} NRF_UARTE_Type;                               /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                        MODEMTIMER0                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Modem Timer/Counter 0 (MODEMTIMER0)
  */

typedef struct {                                /*!< (@ 0x40024000) MODEMTIMER0 Structure                                      */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start Timer                                                */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000004) Stop Timer                                                 */
  __OM  uint32_t  TASKS_CLEAR;                  /*!< (@ 0x00000008) Clear time                                                 */
  __OM  uint32_t  TASKS_SHUTDOWN;               /*!< (@ 0x0000000C) Shut down timer                                            */
  __IM  uint32_t  RESERVED[12];
  __OM  uint32_t  TASKS_CAPTURE[8];             /*!< (@ 0x00000040) Description collection: Capture Timer value to
                                                                    CC[n] register                                             */
  __IM  uint32_t  RESERVED1[40];
  __IOM uint32_t  EVENTS_COMPARE[8];            /*!< (@ 0x00000100) Description collection: Compare event on CC[n]
                                                                    match.                                                     */
  __IM  uint32_t  RESERVED2[56];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED3[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED4[125];
  __IOM uint32_t  RUNNING;                      /*!< (@ 0x00000504) Status of running timer                                    */
  __IM  uint32_t  RESERVED5[14];
  __IOM uint32_t  CCLO0;                        /*!< (@ 0x00000540) Capture/Compare register 0 - Low Word                      */
  __IOM uint32_t  CCHI0;                        /*!< (@ 0x00000544) Capture/Compare register 0 - High Word                     */
  __IOM uint32_t  CCLO1;                        /*!< (@ 0x00000548) Capture/Compare register 1 - Low Word                      */
  __IOM uint32_t  CCHI1;                        /*!< (@ 0x0000054C) Capture/Compare register 1 - High Word                     */
  __IOM uint32_t  CCLO2;                        /*!< (@ 0x00000550) Capture/Compare register 2 - Low Word                      */
  __IOM uint32_t  CCHI2;                        /*!< (@ 0x00000554) Capture/Compare register 2 - High Word                     */
  __IOM uint32_t  CCLO3;                        /*!< (@ 0x00000558) Capture/Compare register 3 - Low Word                      */
  __IOM uint32_t  CCHI3;                        /*!< (@ 0x0000055C) Capture/Compare register 3 - High Word                     */
  __IOM uint32_t  CCLO4;                        /*!< (@ 0x00000560) Capture/Compare register 4 - Low Word                      */
  __IOM uint32_t  CCHI4;                        /*!< (@ 0x00000564) Capture/Compare register 4 - High Word                     */
  __IOM uint32_t  CCLO5;                        /*!< (@ 0x00000568) Capture/Compare register 5 - Low Word                      */
  __IOM uint32_t  CCHI5;                        /*!< (@ 0x0000056C) Capture/Compare register 5 - High Word                     */
  __IOM uint32_t  CCLO6;                        /*!< (@ 0x00000570) Capture/Compare register 6 - Low Word                      */
  __IOM uint32_t  CCHI6;                        /*!< (@ 0x00000574) Capture/Compare register 6 - High Word                     */
  __IOM uint32_t  CCLO7;                        /*!< (@ 0x00000578) Capture/Compare register 7 - Low Word                      */
  __IOM uint32_t  CCHI7;                        /*!< (@ 0x0000057C) Capture/Compare register 7 - High Word                     */
  __IOM uint32_t  COUNTLO;                      /*!< (@ 0x00000580) Internal Counter Value - Low Word                          */
  __IOM uint32_t  COUNTHI;                      /*!< (@ 0x00000584) Internal Counter Value - High Word                         */
  __IM  uint32_t  RESERVED6[669];
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000FFC) Peripheral power control                                   */
} NRF_MODEMTIMER_Type;                          /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real time counter (RTC)
  */

typedef struct {                                /*!< (@ 0x40026000) RTC Structure                                              */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start RTC COUNTER                                          */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000004) Stop RTC COUNTER                                           */
  __OM  uint32_t  TASKS_CLEAR;                  /*!< (@ 0x00000008) Clear RTC COUNTER                                          */
  __OM  uint32_t  TASKS_TRIGOVRFLW;             /*!< (@ 0x0000000C) Set COUNTER to 0xFFFFF0                                    */
  __IM  uint32_t  RESERVED[28];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< (@ 0x00000080) Subscribe configuration for TASKS_START                    */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< (@ 0x00000084) Subscribe configuration for TASKS_STOP                     */
  __IOM uint32_t  SUBSCRIBE_CLEAR;              /*!< (@ 0x00000088) Subscribe configuration for TASKS_CLEAR                    */
  __IOM uint32_t  SUBSCRIBE_TRIGOVRFLW;         /*!< (@ 0x0000008C) Subscribe configuration for TASKS_TRIGOVRFLW               */
  __IM  uint32_t  RESERVED1[28];
  __IOM uint32_t  EVENTS_TICK;                  /*!< (@ 0x00000100) Event on COUNTER increment                                 */
  __IOM uint32_t  EVENTS_OVRFLW;                /*!< (@ 0x00000104) Event on COUNTER overflow                                  */
  __IM  uint32_t  RESERVED2[14];
  __IOM uint32_t  EVENTS_COMPARE[4];            /*!< (@ 0x00000140) Description collection: Compare event on CC[n]
                                                                    match                                                      */
  __IM  uint32_t  RESERVED3[12];
  __IOM uint32_t  PUBLISH_TICK;                 /*!< (@ 0x00000180) Publish configuration for EVENTS_TICK                      */
  __IOM uint32_t  PUBLISH_OVRFLW;               /*!< (@ 0x00000184) Publish configuration for EVENTS_OVRFLW                    */
  __IM  uint32_t  RESERVED4[14];
  __IOM uint32_t  PUBLISH_COMPARE[4];           /*!< (@ 0x000001C0) Description collection: Publish configuration
                                                                    for EVENTS_COMPARE                                         */
  __IM  uint32_t  RESERVED5[76];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED6[13];
  __IOM uint32_t  EVTEN;                        /*!< (@ 0x00000340) Enable or disable event routing                            */
  __IOM uint32_t  EVTENSET;                     /*!< (@ 0x00000344) Enable event routing                                       */
  __IOM uint32_t  EVTENCLR;                     /*!< (@ 0x00000348) Disable event routing                                      */
  __IM  uint32_t  RESERVED7[45];
  __IM  uint32_t  STATUS;                       /*!< (@ 0x00000400) RTC status                                                 */
  __IM  uint32_t  RESERVED8[64];
  __IM  uint32_t  COUNTER;                      /*!< (@ 0x00000504) Current COUNTER value                                      */
  __IOM uint32_t  PRESCALER;                    /*!< (@ 0x00000508) 12 bit prescaler for COUNTER frequency (32768/(PRESCALER+1)).Mu
                                                                    t be written when RTC is stopped                           */
  __IM  uint32_t  RESERVED9[13];
  __IOM uint32_t  CC[4];                        /*!< (@ 0x00000540) Description collection: Compare register n                 */
  __IM  uint32_t  RESERVED10[683];
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000FFC) Peripheral power control                                   */
} NRF_RTC_Type;                                 /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                           LWDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Watchdog Timer 0 (LWDT)
  */

