adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.h
typedef struct {                                /*!< (@ 0x4002B000) IPC Structure                                              */
  __OM  uint32_t  TASKS_SEND[7];                /*!< (@ 0x00000000) Description collection: Trigger events on channel
                                                                    enabled in SEND_CNF[n].                                    */
  __IM  uint32_t  RESERVED[57];
  __IOM uint32_t  EVENTS_RECEIVE[5];            /*!< (@ 0x00000100) Description collection: Event received on one
                                                                    or more of the enabled channels in RECEIVE_CNF[n].         */
  __IM  uint32_t  RESERVED1[123];
  __IOM uint32_t  INTEN0;                       /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET0;                    /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR0;                    /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND0;                     /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IOM uint32_t  INTEN1;                       /*!< (@ 0x00000310) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET1;                    /*!< (@ 0x00000314) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR1;                    /*!< (@ 0x00000318) Disable interrupt                                          */
  __IM  uint32_t  INTPEND1;                     /*!< (@ 0x0000031C) Pending interrupts                                         */
  __IOM uint32_t  INTEN2;                       /*!< (@ 0x00000320) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET2;                    /*!< (@ 0x00000324) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR2;                    /*!< (@ 0x00000328) Disable interrupt                                          */
  __IM  uint32_t  INTPEND2;                     /*!< (@ 0x0000032C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[120];
  __IOM uint32_t  SEND_CNF[7];                  /*!< (@ 0x00000510) Description collection: Send event configuration
                                                                    for TASKS_SEND[n].                                         */
  __IM  uint32_t  RESERVED3[25];
  __IOM uint32_t  RECEIVE_CNF[5];               /*!< (@ 0x00000590) Description collection: Receive event configuration
                                                                    for EVENTS_RECEIVE[n].                                     */
  __IM  uint32_t  RESERVED4[27];
  __IOM uint32_t  GPMEM[2];                     /*!< (@ 0x00000610) Description collection: General purpose memory.            */
} NRF_IPC_Type;                                 /*!< Size = 1560 (0x618)                                                       */



/* =========================================================================================================================== */
/* ================                                           M2M0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Memory to Memory DMA 0 (M2M0)
  */

typedef struct {                                /*!< (@ 0x4002E000) M2M0 Structure                                             */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start DMA transfer                                         */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000004) Stop DMA transfer                                          */
  __IM  uint32_t  RESERVED[62];
  __IOM uint32_t  EVENTS_END;                   /*!< (@ 0x00000100) DMA transfer complete                                      */
  __IOM uint32_t  EVENTS_STARTED;               /*!< (@ 0x00000104) DMA transfer started                                       */
  __IM  uint32_t  RESERVED1[126];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED2[128];
  __IOM M2M_IN_Type IN;                         /*!< (@ 0x00000510) Memory to memory input channel                             */
  __IOM M2M_OUT_Type OUT;                       /*!< (@ 0x00000520) Memory to memory output channel                            */
} NRF_M2M_Type;                                 /*!< Size = 1324 (0x52c)                                                       */



/* =========================================================================================================================== */
/* ================                                          GPIOTE0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO Tasks and Events 0 (GPIOTE0)
  */

typedef struct {                                /*!< (@ 0x40030000) GPIOTE0 Structure                                          */
  __OM  uint32_t  TASKS_OUT[1];                 /*!< (@ 0x00000000) Description collection: Task for writing to pin
                                                                    specified in CONFIG[n].PSEL. Action on pin
                                                                    is configured in CONFIG[n].POLARITY.                       */
  __IM  uint32_t  RESERVED[11];
  __OM  uint32_t  TASKS_SET[1];                 /*!< (@ 0x00000030) Description collection: Task for writing to pin
                                                                    specified in CONFIG[n].PSEL. Action on pin
                                                                    is to set it high.                                         */
  __IM  uint32_t  RESERVED1[11];
  __OM  uint32_t  TASKS_CLR[1];                 /*!< (@ 0x00000060) Description collection: Task for writing to pin
                                                                    specified in CONFIG[n].PSEL. Action on pin
                                                                    is to set it low.                                          */
  __IM  uint32_t  RESERVED2[7];
  __IOM uint32_t  SUBSCRIBE_OUT;                /*!< (@ 0x00000080) Subscribe configuration for TASKS_OUT                      */
  __IOM uint32_t  SUBSCRIBE_SET;                /*!< (@ 0x00000084) Subscribe configuration for TASKS_SET                      */
  __IOM uint32_t  SUBSCRIBE_CLR;                /*!< (@ 0x00000088) Subscribe configuration for TASKS_CLR                      */
  __IM  uint32_t  RESERVED3[29];
  __IOM uint32_t  EVENTS_IN[1];                 /*!< (@ 0x00000100) Description collection: Event generated from
                                                                    pin specified in CONFIG[n].PSEL                            */
  __IM  uint32_t  RESERVED4[30];
  __IOM uint32_t  EVENTS_PORT;                  /*!< (@ 0x0000017C) Event generated from multiple input GPIO pins
                                                                    with SENSE mechanism enabled                               */
  __IOM uint32_t  PUBLISH_IN;                   /*!< (@ 0x00000180) Publish configuration for EVENTS_IN                        */
  __IM  uint32_t  RESERVED5[30];
  __IOM uint32_t  PUBLISH_PORT;                 /*!< (@ 0x000001FC) Publish configuration for EVENTS_IN                        */
  __IM  uint32_t  RESERVED6[64];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED7[129];
  __IOM uint32_t  CONFIG[1];                    /*!< (@ 0x00000510) Description collection: Configuration for OUT[n],
                                                                    SET[n] and CLR[n] tasks and IN[n] event                    */
  __IM  uint32_t  RESERVED8[59];
  __IOM uint32_t  DEBOUNCE[1];                  /*!< (@ 0x00000600) Description collection: Debounce mode for GPIOTE
                                                                    channel n                                                  */
  __IM  uint32_t  RESERVED9[638];
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000FFC) Peripheral power control                                   */
} NRF_GPIOTE_Type;                              /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                        SECCONTROL                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Secure Control (SECCONTROL)
  */

typedef struct {                                /*!< (@ 0x40032000) SECCONTROL Structure                                       */
  __IM  uint32_t  RESERVED[256];
  __OM  uint32_t  OTPTOPADDR;                   /*!< (@ 0x00000400) Top address of the OTP area. Address must be
                                                                    divisible by four                                          */
  __OM  uint32_t  SECUREEXIT;                   /*!< (@ 0x00000404) Writing to this register will enable secure exit.          */
  __IOM uint32_t  SNOOPENABLE;                  /*!< (@ 0x00000408) Enable SecureEntry snooping.                               */
  __IOM uint32_t  SECWRENABLERANGE;             /*!< (@ 0x0000040C) FICR Wr enable range.                                      */
  __IOM uint32_t  AESDMAPROMOTION;              /*!< (@ 0x00000410) AES DMA promoted as a secure device.                       */
  __IOM uint32_t  SHADMAPROMOTION;              /*!< (@ 0x00000414) SHA DMA promoted as a secure device.                       */
  __IOM uint32_t  SECUREWATCHDOGPAUSE;          /*!< (@ 0x00000418) Secure watchdog pause control.                             */
} NRF_SECURECONTROL_Type;                       /*!< Size = 1052 (0x41c)                                                       */



/* =========================================================================================================================== */
/* ================                                        TIMEMARKMUX                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Timemark multiplexer for LTE System Timer (TIMEMARKMUX)
  */

typedef struct {                                /*!< (@ 0x40033000) TIMEMARKMUX Structure                                      */
  __IM  uint32_t  RESERVED[320];
  __IOM uint32_t  ENABLE;                       /*!< (@ 0x00000500) Enable Timemark Mux                                        */
  __IOM uint32_t  TIMEMARK_INPUT_SELECT;        /*!< (@ 0x00000504) Timemark input select register                             */
} NRF_TIMEMARKMUX_Type;                         /*!< Size = 1288 (0x508)                                                       */



/* =========================================================================================================================== */
/* ================                                            P0                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO Port (P0)
  */

typedef struct {                                /*!< (@ 0x40034000) P0 Structure                                               */
  __IM  uint32_t  RESERVED[321];
  __IOM uint32_t  OUT;                          /*!< (@ 0x00000504) Write GPIO port                                            */
  __IOM uint32_t  OUTSET;                       /*!< (@ 0x00000508) Set individual bits in GPIO port                           */
  __IOM uint32_t  OUTCLR;                       /*!< (@ 0x0000050C) Clear individual bits in GPIO port                         */
  __IM  uint32_t  IN;                           /*!< (@ 0x00000510) Read GPIO port                                             */
  __IOM uint32_t  DIR;                          /*!< (@ 0x00000514) Direction of GPIO pins                                     */
  __IOM uint32_t  DIRSET;                       /*!< (@ 0x00000518) DIR set register                                           */
  __IOM uint32_t  DIRCLR;                       /*!< (@ 0x0000051C) DIR clear register                                         */
  __IOM uint32_t  LATCH;                        /*!< (@ 0x00000520) Latch register indicating what GPIO pins that
                                                                    have met the criteria set in the PIN_CNF[n].SENSE
                                                                    registers                                                  */
  __IOM uint32_t  DETECTMODE;                   /*!< (@ 0x00000524) Select between default DETECT signal behaviour
                                                                    and LDETECT mode                                           */
  __IM  uint32_t  RESERVED1[54];
  __IOM GPIO_PIN_Type PIN[4];                   /*!< (@ 0x00000600) Pin n direct access                                        */
  __IM  uint32_t  RESERVED2[56];
  __IOM uint32_t  PIN_CNF[4];                   /*!< (@ 0x00000700) Description collection: Configuration of GPIO
                                                                    pins                                                       */
} NRF_GPIO_Type;                                /*!< Size = 1808 (0x710)                                                       */



/* =========================================================================================================================== */
/* ================                                      TIMEREVENTSYNC                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief Timer event synchronizer (TIMEREVENTSYNC)
  */

typedef struct {                                /*!< (@ 0x40035000) TIMEREVENTSYNC Structure                                   */
  __IOM uint32_t  CLOCKENABLE;                  /*!< (@ 0x00000000) Enable synchronizer clock.                                 */
} NRF_TIMEREVENTSYNC_Type;                      /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           TEMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Temperature Sensor (TEMP)
  */

typedef struct {                                /*!< (@ 0x40039000) TEMP Structure                                             */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start temperature measurement                              */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000004) Stop temperature measurement                               */
  __IM  uint32_t  RESERVED[62];
  __IOM uint32_t  EVENTS_DATARDY;               /*!< (@ 0x00000100) Temperature measurement complete, data ready               */
  __IM  uint32_t  RESERVED1[127];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED2[127];
  __IM  int32_t   TEMP;                         /*!< (@ 0x00000508) Temperature in degC (0.25deg steps)                        */
  __IM  uint32_t  RESERVED3;
  __IM  uint32_t  DATA;                         /*!< (@ 0x00000510) Data after dec and calib                                   */
  __IOM uint32_t  CALIB;                        /*!< (@ 0x00000514) Calibration value. Reset value is taken from
                                                                    FICR-&gt;CHIPCONF01 bit 31:22                              */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint32_t  A0;                           /*!< (@ 0x00000520) Slope of 1st piece wise linear function                    */
  __IOM uint32_t  A1;                           /*!< (@ 0x00000524) Slope of 2nd piece wise linear function                    */
  __IOM uint32_t  A2;                           /*!< (@ 0x00000528) Slope of 3rd piece wise linear function                    */
  __IOM uint32_t  A3;                           /*!< (@ 0x0000052C) Slope of 4th piece wise linear function                    */
  __IOM uint32_t  A4;                           /*!< (@ 0x00000530) Slope of 5th piece wise linear function                    */
  __IOM uint32_t  A5;                           /*!< (@ 0x00000534) Slope of 6th piece wise linear function                    */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  B0;                           /*!< (@ 0x00000540) y-intercept of 1st piece wise linear function              */
  __IOM uint32_t  B1;                           /*!< (@ 0x00000544) y-intercept of 2nd piece wise linear function              */
  __IOM uint32_t  B2;                           /*!< (@ 0x00000548) y-intercept of 3rd piece wise linear function              */
  __IOM uint32_t  B3;                           /*!< (@ 0x0000054C) y-intercept of 4th piece wise linear function              */
  __IOM uint32_t  B4;                           /*!< (@ 0x00000550) y-intercept of 5th piece wise linear function              */
  __IOM uint32_t  B5;                           /*!< (@ 0x00000554) y-intercept of 6th piece wise linear function              */
  __IM  uint32_t  RESERVED6[2];
  __IOM uint32_t  T0;                           /*!< (@ 0x00000560) End point of 1st piece wise linear function                */
  __IOM uint32_t  T1;                           /*!< (@ 0x00000564) End point of 2nd piece wise linear function                */
  __IOM uint32_t  T2;                           /*!< (@ 0x00000568) End point of 3rd piece wise linear function                */
  __IOM uint32_t  T3;                           /*!< (@ 0x0000056C) End point of 4th piece wise linear function                */
  __IOM uint32_t  T4;                           /*!< (@ 0x00000570) End point of 5th piece wise linear function                */
  __IM  uint32_t  RESERVED7[674];
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000FFC) Peripheral power control                                   */
} NRF_TEMP_Type;                                /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                         L2CIPHER                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief L2 Cipher Registers (L2CIPHER)
  */

typedef struct {                                /*!< (@ 0x40040000) L2CIPHER Structure                                         */
  __IM  uint32_t  RESERVED[28];
  __OM  uint32_t  TASKZEROPENALTY_PCP_1;        /*!< (@ 0x00000070) TaskZeroPenalty register for PCP 1                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_1;        /*!< (@ 0x00000074) TaskFullPenalty register for PCP 1                         */
  __OM  uint32_t  TASKZEROPENALTY_PCP_0;        /*!< (@ 0x00000078) TaskZeroPenalty register for PCP 0                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_0;        /*!< (@ 0x0000007C) TaskFullPenalty register for PCP 0                         */
  __IM  uint32_t  RESERVED1[736];
  __IOM uint32_t  PENALTY_REG[2];               /*!< (@ 0x00000C00) Description collection: Penalty register for
                                                                    PCP n                                                      */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  FORCE_OVERRIDE[2];            /*!< (@ 0x00000C10) Description collection: Force override register
                                                                    for PCP n                                                  */
  __IM  uint32_t  RESERVED3[6];
  __IOM uint32_t  TURN_OFF_AUTO_CLOCKSOURCE_REQ;/*!< (@ 0x00000C30) Turn of the automatic clock request.                       */
} NRF_L2CIPHER_Type;                            /*!< Size = 3124 (0xc34)                                                       */



/* =========================================================================================================================== */
/* ================                                           AESL2                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief AES-128 HW accelerator for LTE L2 security and MAC (AESL2)
  */

