adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.h
typedef struct {                                /*!< (@ 0x40042000) AESL2 Structure                                            */
  __OM  uint32_t  TASKS_START_GATHER;           /*!< (@ 0x00000000) Start input DMA                                            */
  __OM  uint32_t  TASKS_STOP_GATHER;            /*!< (@ 0x00000004) Stop input DMA                                             */
  __OM  uint32_t  TASKS_START_SCATTER;          /*!< (@ 0x00000008) Start output DMA                                           */
  __OM  uint32_t  TASKS_STOP_SCATTER;           /*!< (@ 0x0000000C) Stop output DMA                                            */
  __OM  uint32_t  TASKS_INITIALIZE_AES;         /*!< (@ 0x00000010) New keys (and IV) ready to be used, reset keybytes,
                                                                    ivbytes                                                    */
  __OM  uint32_t  TASKS_START_OPERATION;        /*!< (@ 0x00000014) Start cipher / MAC calculation depending on MODE           */
  __OM  uint32_t  TASKS_FINALIZE_MAC;           /*!< (@ 0x00000018) Finalize MAC calculation                                   */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x0000001C) Stop all transfers and crypto operations (initialize)      */
  __IM  uint32_t  RESERVED[20];
  __OM  uint32_t  TaskZeroPenalty_PCP_1;        /*!< (@ 0x00000070) TaskZeroPenalty register for PCP 1                         */
  __OM  uint32_t  TaskFullPenalty_PCP_1;        /*!< (@ 0x00000074) TaskFullPenalty register for PCP 1                         */
  __OM  uint32_t  TaskZeroPenalty_PCP_0;        /*!< (@ 0x00000078) TaskZeroPenalty register for PCP 0                         */
  __OM  uint32_t  TaskFullPenalty_PCP_0;        /*!< (@ 0x0000007C) TaskFullPenalty register for PCP 0                         */
  __IM  uint32_t  RESERVED1[32];
  __IOM uint32_t  EVENTS_GATHER_STARTED;        /*!< (@ 0x00000100) Input DMA started                                          */
  __IOM uint32_t  EVENTS_GATHER_DONE;           /*!< (@ 0x00000104) Input DMA done                                             */
  __IOM uint32_t  EVENTS_SCATTER_STARTED;       /*!< (@ 0x00000108) Output DMA started                                         */
  __IOM uint32_t  EVENTS_SCATTER_DONE;          /*!< (@ 0x0000010C) Output DMA done                                            */
  __IOM uint32_t  EVENTS_IV_READY;              /*!< (@ 0x00000110) IV received (ivbytes == 16)                                */
  __IOM uint32_t  EVENTS_AES_INITIALIZED;       /*!< (@ 0x00000114) New keys and IV taken into use                             */
  __IOM uint32_t  EVENTS_MESSAGE_READY;         /*!< (@ 0x00000118) LENGTH == 0                                                */
  __IOM uint32_t  EVENTS_MAC_READY;             /*!< (@ 0x0000011C) MAC calculated                                             */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x00000120) Resetted (all transfers and crypto operations
                                                                    stopped)                                                   */
  __IM  uint32_t  RESERVED2[55];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED3[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED4[60];
  __IOM uint32_t  LENGTH;                       /*!< (@ 0x00000400) Keystream length in bits (Cipher), message length
                                                                    in bits (MAC)                                              */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000404) Mode: 0 == Cipher, 1 == MAC                                */
  __IM  uint32_t  RESERVED5[126];
  __IM  uint32_t  MAC;                          /*!< (@ 0x00000600) EIA2 MAC                                                   */
  __IM  uint32_t  RESERVED6[127];
  __IOM uint32_t  INJOBPTR;                     /*!< (@ 0x00000800) Input job pointer                                          */
  __IM  uint32_t  RESERVED7[63];
  __IOM uint32_t  OUTJOBPTR;                    /*!< (@ 0x00000900) Output job pointer                                         */
  __IM  uint32_t  RESERVED8[191];
  __IOM uint32_t  PENALTY_REG[2];               /*!< (@ 0x00000C00) Description collection: Penalty register for
                                                                    PCP n                                                      */
  __IM  uint32_t  RESERVED9[2];
  __IOM uint32_t  FORCE_OVERRIDE[2];            /*!< (@ 0x00000C10) Description collection: Force override register
                                                                    for PCP n                                                  */
  __IM  uint32_t  RESERVED10[6];
  __IOM uint32_t  TURN_OFF_AUTO_CLOCKSOURCE_REQ;/*!< (@ 0x00000C30) Turn of the automatic clock request.                       */
} NRF_AESL2_Type;                               /*!< Size = 3124 (0xc34)                                                       */



/* =========================================================================================================================== */
/* ================                                           SNOW                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Snow 3G Security IP (SNOW)
  */

typedef struct {                                /*!< (@ 0x40043000) SNOW Structure                                             */
  __OM  uint32_t  TASKS_STARTGATHER;            /*!< (@ 0x00000000) Start input DMA                                            */
  __OM  uint32_t  TASKS_STOPGATHER;             /*!< (@ 0x00000004) Stop input DMA                                             */
  __OM  uint32_t  TASKS_STARTSCATTER;           /*!< (@ 0x00000008) Start output DMA                                           */
  __OM  uint32_t  TASKS_STOPSCATTER;            /*!< (@ 0x0000000C) Stop output DMA                                            */
  __OM  uint32_t  TASKS_INITIALIZESNOW3G;       /*!< (@ 0x00000010) New keys (and IV) ready to be used, reset keybytes,
                                                                    ivbytes                                                    */
  __OM  uint32_t  TASKS_STARTOPERATION;         /*!< (@ 0x00000014) Start cipher / MAC calculation depending on MODE           */
  __OM  uint32_t  TASKS_FINALIZEMAC;            /*!< (@ 0x00000018) Finalize MAC calculation                                   */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x0000001C) Stop all transfers and crypto operations (initialize)      */
  __IM  uint32_t  RESERVED[20];
  __OM  uint32_t  TaskZeroPenalty_PCP_1;        /*!< (@ 0x00000070) TaskZeroPenalty register for PCP 1                         */
  __OM  uint32_t  TaskFullPenalty_PCP_1;        /*!< (@ 0x00000074) TaskFullPenalty register for PCP 1                         */
  __OM  uint32_t  TaskZeroPenalty_PCP_0;        /*!< (@ 0x00000078) TaskZeroPenalty register for PCP 0                         */
  __OM  uint32_t  TaskFullPenalty_PCP_0;        /*!< (@ 0x0000007C) TaskFullPenalty register for PCP 0                         */
  __IM  uint32_t  RESERVED1[32];
  __IOM uint32_t  EVENTS_GATHERSTARTED;         /*!< (@ 0x00000100) Input DMA started                                          */
  __IOM uint32_t  EVENTS_GATHERDONE;            /*!< (@ 0x00000104) Input DMA done                                             */
  __IOM uint32_t  EVENTS_SCATTERSTARTED;        /*!< (@ 0x00000108) Output DMA started                                         */
  __IOM uint32_t  EVENTS_SCATTERDONE;           /*!< (@ 0x0000010C) Output DMA done                                            */
  __IOM uint32_t  EVENTS_IVREADY;               /*!< (@ 0x00000110) IV received (ivbytes == 16)                                */
  __IOM uint32_t  EVENTS_SNOW3GINITIALIZED;     /*!< (@ 0x00000114) New keys and IV taken into use                             */
  __IOM uint32_t  EVENTS_MESSAGEREADY;          /*!< (@ 0x00000118) LENGTH == 0                                                */
  __IOM uint32_t  EVENTS_MACREADY;              /*!< (@ 0x0000011C) MAC calculated                                             */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x00000120) Resetted (all transfers and crypto operations
                                                                    stopped)                                                   */
  __IM  uint32_t  RESERVED2[55];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED3[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED4[60];
  __IOM uint32_t  LENGTH;                       /*!< (@ 0x00000400) Keystream length in bits (Cipher), message length
                                                                    in bits (MAC)                                              */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000404) Mode select                                                */
  __IM  uint32_t  RESERVED5[126];
  __IM  uint32_t  MAC;                          /*!< (@ 0x00000600) Message Authentication Code.                               */
  __IM  uint32_t  RESERVED6[127];
  __IOM uint32_t  INJOBPTR;                     /*!< (@ 0x00000800) Input job pointer                                          */
  __IM  uint32_t  RESERVED7[63];
  __IOM uint32_t  OUTJOBPTR;                    /*!< (@ 0x00000900) Output job pointer                                         */
  __IM  uint32_t  RESERVED8[191];
  __IOM uint32_t  PENALTY_REG[2];               /*!< (@ 0x00000C00) Description collection: Penalty register for
                                                                    PCP n                                                      */
  __IM  uint32_t  RESERVED9[2];
  __IOM uint32_t  FORCE_OVERRIDE[2];            /*!< (@ 0x00000C10) Description collection: Force override register
                                                                    for PCP n                                                  */
  __IM  uint32_t  RESERVED10[6];
  __IOM uint32_t  TURN_OFF_AUTO_CLOCKSOURCE_REQ;/*!< (@ 0x00000C30) Turn of the automatic clock request.                       */
} NRF_SNOW_Type;                                /*!< Size = 3124 (0xc34)                                                       */



/* =========================================================================================================================== */
/* ================                                            ZUC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ZUC LTE L2 security IP (ZUC)
  */

typedef struct {                                /*!< (@ 0x40044000) ZUC Structure                                              */
  __OM  uint32_t  TASKS_STARTGATHER;            /*!< (@ 0x00000000) Start input DMA                                            */
  __OM  uint32_t  TASKS_STOPGATHER;             /*!< (@ 0x00000004) Stop input DMA                                             */
  __OM  uint32_t  TASKS_STARTSCATTER;           /*!< (@ 0x00000008) Start output DMA                                           */
  __OM  uint32_t  TASKS_STOPSCATTER;            /*!< (@ 0x0000000C) Stop output DMA                                            */
  __OM  uint32_t  TASKS_INITIALIZEZUC;          /*!< (@ 0x00000010) New keys (and IV) ready to be used, reset keybytes,
                                                                    ivbytes                                                    */
  __OM  uint32_t  TASKS_STARTOPERATION;         /*!< (@ 0x00000014) Start cipher / MAC calculation depending on MODE           */
  __OM  uint32_t  TASKS_FINALIZEMAC;            /*!< (@ 0x00000018) Finalize MAC calculation                                   */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x0000001C) Stop all transfers and crypto operations (initialize)      */
  __IM  uint32_t  RESERVED[20];
  __OM  uint32_t  TASKZEROPENALTY_PCP_1;        /*!< (@ 0x00000070) TaskZeroPenalty register for PCP 1                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_1;        /*!< (@ 0x00000074) TaskFullPenalty register for PCP 1                         */
  __OM  uint32_t  TASKZEROPENALTY_PCP_0;        /*!< (@ 0x00000078) TaskZeroPenalty register for PCP 0                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_0;        /*!< (@ 0x0000007C) TaskFullPenalty register for PCP 0                         */
  __IM  uint32_t  RESERVED1[32];
  __IOM uint32_t  EVENTS_GATHERSTARTED;         /*!< (@ 0x00000100) Input DMA started                                          */
  __IOM uint32_t  EVENTS_GATHERDONE;            /*!< (@ 0x00000104) Input DMA done                                             */
  __IOM uint32_t  EVENTS_SCATTERSTARTED;        /*!< (@ 0x00000108) Output DMA started                                         */
  __IOM uint32_t  EVENTS_SCATTERDONE;           /*!< (@ 0x0000010C) Output DMA done                                            */
  __IOM uint32_t  EVENTS_IVREADY;               /*!< (@ 0x00000110) IV received (ivbytes == 16)                                */
  __IOM uint32_t  EVENTS_ZUCINITIALIZED;        /*!< (@ 0x00000114) New keys and IV taken into use                             */
  __IOM uint32_t  EVENTS_MESSAGEREADY;          /*!< (@ 0x00000118) LENGTH == 0                                                */
  __IOM uint32_t  EVENTS_MACREADY;              /*!< (@ 0x0000011C) MAC calculated                                             */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x00000120) Resetted (all transfers and crypto operations
                                                                    stopped)                                                   */
  __IM  uint32_t  RESERVED2[55];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED3[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED4[60];
  __IOM uint32_t  LENGTH;                       /*!< (@ 0x00000400) Keystream length in bits (Cipher), message length
                                                                    in bits (MAC)                                              */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000404) Mode select                                                */
  __IM  uint32_t  RESERVED5[126];
  __IM  uint32_t  MAC;                          /*!< (@ 0x00000600) Message Authentication Code.                               */
  __IM  uint32_t  RESERVED6[127];
  __IOM uint32_t  INDCP_MEMORY_ADDR;            /*!< (@ 0x00000800) Pointer to input DMA scatter and gather job list
                                                                    (Write) / current output job address (Read)                */
  __IM  uint32_t  RESERVED7[63];
  __IOM uint32_t  OUTDCP_MEMORY_ADDR;           /*!< (@ 0x00000900) Pointer to output DMA scatter and gather job
                                                                    list (Write) / current output job address
                                                                    (Read)                                                     */
  __IM  uint32_t  RESERVED8[191];
  __IOM uint32_t  PENALTY_REG[2];               /*!< (@ 0x00000C00) Description collection: Penalty register for
                                                                    PCP n                                                      */
  __IM  uint32_t  RESERVED9[2];
  __IOM uint32_t  FORCE_OVERRIDE[2];            /*!< (@ 0x00000C10) Description collection: Force override register
                                                                    for PCP n                                                  */
  __IM  uint32_t  RESERVED10[6];
  __IOM uint32_t  TURN_OFF_AUTO_CLOCKSOURCE_REQ;/*!< (@ 0x00000C30) Turn of the automatic clock request.                       */
} NRF_ZUC_Type;                                 /*!< Size = 3124 (0xc34)                                                       */



/* =========================================================================================================================== */
/* ================                                            SHA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SHA-1/SHA-256 (SHA)
  */

