adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.h
typedef struct {                                /*!< (@ 0x40052000) DESCIPHER Structure                                        */
  __OM  uint32_t  TASKS_START_GATHER;           /*!< (@ 0x00000000) Start input DMA                                            */
  __OM  uint32_t  TASKS_STOP_GATHER;            /*!< (@ 0x00000004) Stop input DMA                                             */
  __OM  uint32_t  TASKS_START_SCATTER;          /*!< (@ 0x00000008) Start output DMA                                           */
  __OM  uint32_t  TASKS_STOP_SCATTER;           /*!< (@ 0x0000000C) Stop output DMA                                            */
  __OM  uint32_t  TASKS_INITIALIZE_DES;         /*!< (@ 0x00000010) New keys (and IV) ready to be used, reset keybytes,
                                                                    ivbytes                                                    */
  __OM  uint32_t  TASKS_FILL_DES_INPUT;         /*!< (@ 0x00000014) Transfer 8 bytes of input from DMA to DES core             */
  __OM  uint32_t  TASKS_DES_ENCRYPT_1;          /*!< (@ 0x00000018) Starts DES encryption with keyset 1 ( input -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_DECRYPT_1;          /*!< (@ 0x0000001C) Starts DES decryption with keyset 1 ( input -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_ENCRYPT_2;          /*!< (@ 0x00000020) Starts DES encryption with keyset 2 (output -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_DECRYPT_2;          /*!< (@ 0x00000024) Starts DES decryption with keyset 2 (output -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_ENCRYPT_3;          /*!< (@ 0x00000028) Starts DES encryption with keyset 3 (output -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_DECRYPT_3;          /*!< (@ 0x0000002C) Starts DES decryption with keyset 3 (output -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DRAIN_DES_OUTPUT;       /*!< (@ 0x00000030) Transfer 8 bytes of output from DES core to DMA            */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x00000034) Stop all transfers and crypto operations (software
                                                                    reset)                                                     */
  __IM  uint32_t  RESERVED[14];
  __OM  uint32_t  TASKZEROPENALTY_PCP_1;        /*!< (@ 0x00000070) TaskZeroPenalty register for PCP 1                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_1;        /*!< (@ 0x00000074) TaskFullPenalty register for PCP 1                         */
  __OM  uint32_t  TASKZEROPENALTY_PCP_0;        /*!< (@ 0x00000078) TaskZeroPenalty register for PCP 0                         */
  __OM  uint32_t  TASKFULLPENALTY_PCP_0;        /*!< (@ 0x0000007C) TaskFullPenalty register for PCP 0                         */
  __IM  uint32_t  RESERVED1[32];
  __IOM uint32_t  EVENTS_GATHER_STARTED;        /*!< (@ 0x00000100) Input DMA started                                          */
  __IOM uint32_t  EVENTS_GATHER_DONE;           /*!< (@ 0x00000104) Input DMA done                                             */
  __IOM uint32_t  EVENTS_SCATTER_STARTED;       /*!< (@ 0x00000108) Output DMA started                                         */
  __IOM uint32_t  EVENTS_SCATTER_DONE;          /*!< (@ 0x0000010C) Output DMA done                                            */
  __IOM uint32_t  EVENTS_KEY_1_READY;           /*!< (@ 0x00000110) Key #1 received (keybytes == 8)                            */
  __IOM uint32_t  EVENTS_KEY_3_READY;           /*!< (@ 0x00000114) Keys #1, #2 and #3 received (keybytes == 24)               */
  __IOM uint32_t  EVENTS_IV_READY;              /*!< (@ 0x00000118) IV received (ivbytes == 8)                                 */
  __IOM uint32_t  EVENTS_DES_INITIALIZED;       /*!< (@ 0x0000011C) New keys (and IV) taken into use                           */
  __IOM uint32_t  EVENTS_DES_INPUT_FULL;        /*!< (@ 0x00000120) 8 bytes of input stored to DES core                        */
  __IOM uint32_t  EVENTS_DES_DONE_1;            /*!< (@ 0x00000124) Action with key 1 ready                                    */
  __IOM uint32_t  EVENTS_DES_DONE_2;            /*!< (@ 0x00000128) Action with key 2 ready                                    */
  __IOM uint32_t  EVENTS_DES_DONE_3;            /*!< (@ 0x0000012C) Action with key 3 ready                                    */
  __IOM uint32_t  EVENTS_DES_OUTPUT_EMPTY;      /*!< (@ 0x00000130) 8 bytes of output read from DES core                       */
  __IOM uint32_t  EVENTS_MESSAGE_READY;         /*!< (@ 0x00000134) LENGTH == 0, message processed                             */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x00000138) Resetted (all transfers and crypto operations
                                                                    stopped)                                                   */
  __IM  uint32_t  RESERVED2[49];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED3[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED4[60];
  __IOM uint32_t  LENGTH;                       /*!< (@ 0x00000400) Data length in bytes                                       */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000404) Mode: 0 == ECB, 1 == CBC                                   */
  __IM  uint32_t  RESERVED5[62];
  __IOM uint32_t  ENABLE;                       /*!< (@ 0x00000500) Enable/disable block                                       */
  __IM  uint32_t  RESERVED6[191];
  __IOM uint32_t  INJOBPTR;                     /*!< (@ 0x00000800) Input DMA job pointer register                             */
  __IM  uint32_t  RESERVED7[63];
  __IOM uint32_t  OUTJOBPTR;                    /*!< (@ 0x00000900) Output DMA job pointer register                            */
  __IM  uint32_t  RESERVED8[191];
  __IOM uint32_t  PENALTY_REG[2];               /*!< (@ 0x00000C00) Description collection: Penalty register for
                                                                    PCP n                                                      */
  __IM  uint32_t  RESERVED9[2];
  __IOM uint32_t  FORCE_OVERRIDE[2];            /*!< (@ 0x00000C10) Description collection: Force override register
                                                                    for PCP n                                                  */
  __IM  uint32_t  RESERVED10[6];
  __IOM uint32_t  TURN_OFF_AUTO_CLOCKSOURCE_REQ;/*!< (@ 0x00000C30) Turn of the automatic clock request.                       */
} NRF_DES_Type;                                 /*!< Size = 3124 (0xc34)                                                       */



/* =========================================================================================================================== */
/* ================                                           BPROT                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Block Protect (BPROT)
  */

typedef struct {                                /*!< (@ 0x40060000) BPROT Structure                                            */
  __IM  uint32_t  RESERVED[449];
  __IOM uint32_t  DISABLEINDEBUG;               /*!< (@ 0x00000704) Disable protection mechanism in debug mode                 */
  __IOM uint32_t  CONFIG0;                      /*!< (@ 0x00000708) Block protect configuration register 0                     */
  __IOM uint32_t  CONFIG1;                      /*!< (@ 0x0000070C) Block protect configuration register 0                     */
  __IOM uint32_t  CONFIG2;                      /*!< (@ 0x00000710) Block protect configuration register 0                     */
  __IOM uint32_t  CONFIG3;                      /*!< (@ 0x00000714) Block protect configuration register 0                     */
  __IOM uint32_t  CONFIG4;                      /*!< (@ 0x00000718) Block protect configuration register 0                     */
  __IOM uint32_t  CONFIG5;                      /*!< (@ 0x0000071C) Block protect configuration register 0                     */
  __IOM uint32_t  CONFIG6;                      /*!< (@ 0x00000720) Block protect configuration register 0                     */
  __IOM uint32_t  CONFIG7;                      /*!< (@ 0x00000724) Block protect configuration register 0                     */
} NRF_BPROT_Type;                               /*!< Size = 1832 (0x728)                                                       */



/* =========================================================================================================================== */
/* ================                                           NVMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Non Volatile Memory Controller (NVMC)
  */

typedef struct {                                /*!< (@ 0x40060000) NVMC Structure                                             */
  __IM  uint32_t  RESERVED[256];
  __IM  uint32_t  READY;                        /*!< (@ 0x00000400) Ready flag                                                 */
  __IM  uint32_t  VERIFYFAILED;                 /*!< (@ 0x00000404) Flag to signal that a flash erase or write operation
                                                                    has failed                                                 */
  __IM  uint32_t  RESERVED1[63];
  __IOM uint32_t  CONFIG;                       /*!< (@ 0x00000504) Configuration register                                     */
  
  union {
    __IOM uint32_t ERASEPAGE;                   /*!< (@ 0x00000508) Register for erasing a page in Code area                   */
    __IOM uint32_t ERASEPCR1;                   /*!< (@ 0x00000508) Deprecated register - Register for erasing a
                                                                    page in Code area. Equivalent to ERASEPAGE.                */
  };
  __IOM uint32_t  ERASEALL;                     /*!< (@ 0x0000050C) Register for erasing all non-volatile user memory          */
  __IOM uint32_t  ERASEPCR0;                    /*!< (@ 0x00000510) Deprecated register - Register for erasing a
                                                                    page in Code area. Equivalent to ERASEPAGE.                */
  __IOM uint32_t  ERASEUICR;                    /*!< (@ 0x00000514) Register for erasing User Information Configuration
                                                                    Registers                                                  */
  __IM  uint32_t  RESERVED2[10];
  __IOM uint32_t  ICACHECNF;                    /*!< (@ 0x00000540) I-Code cache configuration register.                       */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  IHIT;                         /*!< (@ 0x00000548) I-Code cache hit counter.                                  */
  __IOM uint32_t  IMISS;                        /*!< (@ 0x0000054C) I-Code cache miss counter.                                 */
  __IM  uint32_t  RESERVED4[44];
  __IOM uint32_t  TESTMODE;                     /*!< (@ 0x00000600) Register for entering test mode. Refer to the
                                                                    flash IP test documentation for more details.              */
  __IM  uint32_t  RESERVED5[3];
  __OM  uint32_t  TESTMASSERASE;                /*!< (@ 0x00000610) Self-timed mass-erase operation                            */
  __OM  uint32_t  TESTERASEREFCELL;             /*!< (@ 0x00000614) Self-timed erase reference cell operation                  */
  __IM  uint32_t  TESTTC;                       /*!< (@ 0x00000618) Observe the TC output from the flash macro                 */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  TESTDATA128[4];               /*!< (@ 0x00000620) Description collection: Direct flash test data
                                                                    word n                                                     */
  __IM  uint32_t  TESTDATA128INC[4];            /*!< (@ 0x00000630) Description collection: Direct flash test data
                                                                    word n. Post-increments TESTCONTROLADDR                    */
  __IM  uint32_t  TESTCMPINC;                   /*!< (@ 0x00000640) Reads and compares last flash row to TESTDATA128
                                                                    content. Post-increments TESTCONTROLADDR.                  */
  __IM  uint32_t  TESTNCMPINC;                  /*!< (@ 0x00000644) Reads and compares last flash row to complement
                                                                    of TESTDATA128 content. Post-increments
                                                                    TESTCONTROLADDR.                                           */
  __IOM uint32_t  TESTCONTROLLINES;             /*!< (@ 0x00000648) Direct flash test, control lines. Refer to the
                                                                    flash IP test documentation for more details.              */
  __IOM uint32_t  TESTCONTROLADDR;              /*!< (@ 0x0000064C) Direct flash test control, address lines                   */
  __IOM uint32_t  TESTCOUNTERRELOAD;            /*!< (@ 0x00000650) Counter reload value, used when counting from
                                                                    SE or YE rising edge to latching of data                   */
  __IM  uint32_t  TESTCOUNTERRUNNING;           /*!< (@ 0x00000654) Returns the state (counting or not) of the counter         */
  __IOM uint32_t  TESTCONFIG;                   /*!< (@ 0x00000658) Mode of operation of the counter                           */
  __IOM uint32_t  TESTTMVPPANAEN;               /*!< (@ 0x0000065C) Controls analog signals for flash measurements             */
  __IM  uint32_t  TESTTC_2;                     /*!< (@ 0x00000660) Observe the TC output from the flash. Flash macro
                                                                    2.                                                         */
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  TESTDATA128_2[4];             /*!< (@ 0x00000668) Description collection: Direct flash test data
                                                                    word n. Flash macro 2.                                     */
  __IM  uint32_t  TESTDATA128INC_2[4];          /*!< (@ 0x00000678) Description collection: Direct flash test data
                                                                    word n. Post-increments TESTCONTROLADDR.
                                                                    Flash macro 2.                                             */
  __IM  uint32_t  TESTCMPINC_2;                 /*!< (@ 0x00000688) Reads and compares last flash row to TESTDATA128
                                                                    content. Post-increments TESTCONTROLADDR.
                                                                    Flash macro 2.                                             */
  __IM  uint32_t  TESTNCMPINC_2;                /*!< (@ 0x0000068C) Reads and compares last flash row to complement
                                                                    of TESTDATA128 content. Post-increments
                                                                    TESTCONTROLADDR. Flash macro 2.                            */
  __IOM uint32_t  TESTCONTROLLINES_2;           /*!< (@ 0x00000690) Direct flash test, control lines. Refer to the
                                                                    flash IP test documentation for more details.
                                                                    Flash macro 2.                                             */
  __IOM uint32_t  TESTCONTROLADDR_2;            /*!< (@ 0x00000694) Direct flash test control, address lines. Flash
                                                                    macro 2.                                                   */
  __IOM uint32_t  TESTCOUNTERRELOAD_2;          /*!< (@ 0x00000698) Counter reload value, used when counting from
                                                                    SE or YE rising edge to latching of data.
                                                                    Flash macro 2.                                             */
  __IM  uint32_t  TESTCOUNTERRUNNING_2;         /*!< (@ 0x0000069C) Returns the state (counting or not) of the counter.
                                                                    Flash macro 2.                                             */
  __IOM uint32_t  TESTCONFIG_2;                 /*!< (@ 0x000006A0) Mode of operation of the counter. Flash macro
                                                                    2.                                                         */
  __IOM uint32_t  TESTTMVPPANAEN_2;             /*!< (@ 0x000006A4) Controls analog signals for flash measurements.
                                                                    Flash macro 2.                                             */
  __IM  uint32_t  RESERVED8[22];
  __IOM uint32_t  FORCEONNVM;                   /*!< (@ 0x00000700) Force on NVM. See also the internal section in
                                                                    the NVMC chapter.                                          */
} NRF_NVMC_Type;                                /*!< Size = 1796 (0x704)                                                       */



/* =========================================================================================================================== */
/* ================                                            VMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Volatile Memory controller (VMC)
  */

