adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.h
typedef struct {                                /*!< (@ 0x40061000) VMC Structure                                              */
  __IM  uint32_t  RESERVED[384];
  __IOM VMC_RAM_Type RAM[4];                    /*!< (@ 0x00000600) Unspecified                                                */
  __IM  uint32_t  RESERVED1[48];
  __IOM VMC_RAMA_Type RAMA;                     /*!< (@ 0x00000700) Unspecified                                                */
  __IM  uint32_t  RESERVED2;
  __IOM VMC_RAMB_Type RAMB[2];                  /*!< (@ 0x00000710) Unspecified                                                */
  __IM  uint32_t  RESERVED3[52];
  __IOM VMC_RAMC_Type RAMC[2];                  /*!< (@ 0x00000800) Unspecified                                                */
  __IM  uint32_t  RESERVED4[56];
  __IOM VMC_RAMD_Type RAMD;                     /*!< (@ 0x00000900) Unspecified                                                */
  __IM  uint32_t  RESERVED5[374];
  __IOM uint32_t  SRAMTRIM;                     /*!< (@ 0x00000EE4) Backdoor trim values for SRAM                              */
  __IOM uint32_t  RamSSNonRetTSel;              /*!< (@ 0x00000EE8) Timing control values for TSMC RAMs                        */
} NRF_VMC_Type;                                 /*!< Size = 3820 (0xeec)                                                       */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define NRF_FICR_BASE               0x00FF0000UL
#define NRF_UICR_BASE               0x00FF8000UL
#define NRF_TRACEANDDEBUG_BASE      0xE0080000UL
#define NRF_AMLI_BASE               0x40000000UL
#define NRF_DCNF_BASE               0x40000000UL
#define NRF_MWU_BASE                0x40001000UL
#define NRF_MCPLL_BASE              0x40010000UL
#define NRF_BBDLL_BASE              0x40011000UL
#define NRF_RCOSC32K_BASE           0x40012000UL
#define NRF_DCLOCK_BASE             0x40015000UL
#define NRF_DPOWER_BASE             0x40015000UL
#define NRF_MODEMPERIPH_BASE        0x40021000UL
#define NRF_UARTE_BASE              0x40023000UL
#define NRF_MODEMTIMER0_BASE        0x40024000UL
#define NRF_MODEMTIMER1_BASE        0x40025000UL
#define NRF_RTC_BASE                0x40026000UL
#define NRF_LWDT_BASE               0x40027000UL
#define NRF_SWDT_BASE               0x40028000UL
#define NRF_RNG_BASE                0x40029000UL
#define NRF_SIMIF_BASE              0x4002A000UL
#define NRF_IPC_BASE                0x4002B000UL
#define NRF_M2M0_BASE               0x4002E000UL
#define NRF_M2M1_BASE               0x4002F000UL
#define NRF_GPIOTE0_BASE            0x40030000UL
#define NRF_GPIOTE1_BASE            0x40031000UL
#define NRF_SECCONTROL_BASE         0x40032000UL
#define NRF_TIMEMARKMUX_BASE        0x40033000UL
#define NRF_P0_BASE                 0x40034000UL
#define NRF_TIMEREVENTSYNC_BASE     0x40035000UL
#define NRF_TEMP_BASE               0x40039000UL
#define NRF_L2CIPHER_BASE           0x40040000UL
#define NRF_AESL2_BASE              0x40042000UL
#define NRF_SNOW_BASE               0x40043000UL
#define NRF_ZUC_BASE                0x40044000UL
#define NRF_SHA_BASE                0x40050000UL
#define NRF_DESCIPHER_BASE          0x40052000UL
#define NRF_BPROT_BASE              0x40060000UL
#define NRF_NVMC_BASE               0x40060000UL
#define NRF_VMC_BASE                0x40061000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define NRF_FICR                    ((NRF_FICR_Type*)          NRF_FICR_BASE)
#define NRF_UICR                    ((NRF_UICR_Type*)          NRF_UICR_BASE)
#define NRF_TRACEANDDEBUG           ((NRF_TRACEANDDEBUGALTA_Type*)  NRF_TRACEANDDEBUG_BASE)
#define NRF_AMLI                    ((NRF_AMLI_Type*)          NRF_AMLI_BASE)
#define NRF_DCNF                    ((NRF_DCNF_Type*)          NRF_DCNF_BASE)
#define NRF_MWU                     ((NRF_MWU_Type*)           NRF_MWU_BASE)
#define NRF_MCPLL                   ((NRF_MCPLL_Type*)         NRF_MCPLL_BASE)
#define NRF_BBDLL                   ((NRF_BBDLL_Type*)         NRF_BBDLL_BASE)
#define NRF_RCOSC32K                ((NRF_RCOSC32K_Type*)      NRF_RCOSC32K_BASE)
#define NRF_DCLOCK                  ((NRF_DCLOCK_Type*)        NRF_DCLOCK_BASE)
#define NRF_DPOWER                  ((NRF_DPOWER_Type*)        NRF_DPOWER_BASE)
#define NRF_MODEMPERIPH             ((NRF_MODEMPERIPH_Type*)   NRF_MODEMPERIPH_BASE)
#define NRF_UARTE                   ((NRF_UARTE_Type*)         NRF_UARTE_BASE)
#define NRF_MODEMTIMER0             ((NRF_MODEMTIMER_Type*)    NRF_MODEMTIMER0_BASE)
#define NRF_MODEMTIMER1             ((NRF_MODEMTIMER_Type*)    NRF_MODEMTIMER1_BASE)
#define NRF_RTC                     ((NRF_RTC_Type*)           NRF_RTC_BASE)
#define NRF_LWDT                    ((NRF_WDT_Type*)           NRF_LWDT_BASE)
#define NRF_SWDT                    ((NRF_WDT_Type*)           NRF_SWDT_BASE)
#define NRF_RNG                     ((NRF_RNG_Type*)           NRF_RNG_BASE)
#define NRF_SIMIF                   ((NRF_SIMIF_Type*)         NRF_SIMIF_BASE)
#define NRF_IPC                     ((NRF_IPC_Type*)           NRF_IPC_BASE)
#define NRF_M2M0                    ((NRF_M2M_Type*)           NRF_M2M0_BASE)
#define NRF_M2M1                    ((NRF_M2M_Type*)           NRF_M2M1_BASE)
#define NRF_GPIOTE0                 ((NRF_GPIOTE_Type*)        NRF_GPIOTE0_BASE)
#define NRF_GPIOTE1                 ((NRF_GPIOTE_Type*)        NRF_GPIOTE1_BASE)
#define NRF_SECCONTROL              ((NRF_SECURECONTROL_Type*)  NRF_SECCONTROL_BASE)
#define NRF_TIMEMARKMUX             ((NRF_TIMEMARKMUX_Type*)   NRF_TIMEMARKMUX_BASE)
#define NRF_P0                      ((NRF_GPIO_Type*)          NRF_P0_BASE)
#define NRF_TIMEREVENTSYNC          ((NRF_TIMEREVENTSYNC_Type*)  NRF_TIMEREVENTSYNC_BASE)
#define NRF_TEMP                    ((NRF_TEMP_Type*)          NRF_TEMP_BASE)
#define NRF_L2CIPHER                ((NRF_L2CIPHER_Type*)      NRF_L2CIPHER_BASE)
#define NRF_AESL2                   ((NRF_AESL2_Type*)         NRF_AESL2_BASE)
#define NRF_SNOW                    ((NRF_SNOW_Type*)          NRF_SNOW_BASE)
#define NRF_ZUC                     ((NRF_ZUC_Type*)           NRF_ZUC_BASE)
#define NRF_SHA                     ((NRF_SHA_Type*)           NRF_SHA_BASE)
#define NRF_DESCIPHER               ((NRF_DES_Type*)           NRF_DESCIPHER_BASE)
#define NRF_BPROT                   ((NRF_BPROT_Type*)         NRF_BPROT_BASE)
#define NRF_NVMC                    ((NRF_NVMC_Type*)          NRF_NVMC_BASE)
#define NRF_VMC                     ((NRF_VMC_Type*)           NRF_VMC_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif

#endif /* NRF9120_MLM1_MODEM_H */


/** @} */ /* End of group nrf9120_mlm1_modem */

/** @} */ /* End of group Nordic Semiconductor */
